Revit 2024 API
OBJExportOptions.IsNormalToleranceSet Method
 Checks whether the NormalTolerance tessellation parameter is explicitly set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public bool IsNormalToleranceSet()
Visual Basic
Public Function IsNormalToleranceSet As Boolean
Visual C++
public:
bool IsNormalToleranceSet()
Return Value
 True if NormalTolerance tessellation parameter is explicitly set, false otherwise.
See Also
OBJExportOptions Class
Autodesk.Revit.DB Namespace